## Linear Regression Machine Learning Implementation, Case: South Jakarta House Price
## Part 1: Preprocessing and Cleaning Up Raw Data
### Author: Edycakra Immanuel Sinaga

In [416]:
#import dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# Understanding the Raw Dataset
This dataset is scraped from OLX website, contains house price data in Jakarta Selatan

### 1. Read the raw dataset

In [417]:
df = pd.read_csv('../data/raw/olx_house_scraped.csv', encoding='latin-1')

In [418]:
df.head()

,ï»¿web-scraper-order,web-scraper-start-url,house,house-href,price,location,luas_bangunan,luas_tanah,sertifikasi,n_bedroom,n_bathroom,n_lantai
0,1669844714-482,https://www.olx.co.id/jakarta-selatan_g4000030...,HighlightRp 2.460.000.0005 KT - 5 KM - 200 m2R...,https://www.olx.co.id/item/rumah-luas-strategi...,Rp 2.460.000.000,"Jagakarsa, Jakarta Selatan, Jakarta D.K.I.",200.0,133.0,SHM - Sertifikat Hak Milik,5,5,2.0
1,1669844722-483,https://www.olx.co.id/jakarta-selatan_g4000030...,HighlightRp 875.000.0002 KT - 1 KM - 45 m2Jual...,https://www.olx.co.id/item/jual-rumah-ciputat-...,Rp 875.000.000,"Ciputat, Tangerang Selatan Kota, Banten",45.0,140.0,SHM - Sertifikat Hak Milik,2,1,1.0
2,1669844729-484,https://www.olx.co.id/jakarta-selatan_g4000030...,HighlightRp 1.310.000.0003 KT - 2 KM - 75 m2Ru...,https://www.olx.co.id/item/rumah-minimalis-dek...,Rp 1.310.000.000,"Ciledug, Tangerang Kota, Banten",75.0,100.0,SHM - Sertifikat Hak Milik,3,2,1.0
3,1669844736-485,https://www.olx.co.id/jakarta-selatan_g4000030...,HighlightRp 7.500.000.0005 KT - 4 KM - 350 m2L...,https://www.olx.co.id/item/langka-siap-huni-ru...,Rp 7.500.000.000,"Palmerah, Jakarta Barat, Jakarta D.K.I.",350.0,235.0,SHM - Sertifikat Hak Milik,5,4,2.0
4,1669844747-486,https://www.olx.co.id/jakarta-selatan_g4000030...,HighlightRp 2.460.000.0005 KT - 5 KM - 200 m2R...,https://www.olx.co.id/item/rumah-siap-kpr-di-c...,Rp 2.460.000.000,"Cinere, Depok Kota, Jawa Barat",200.0,133.0,SHM - Sertifikat Hak Milik,5,5,2.0

### 2. Preprocessing

2a. Dropping unused columns: web-scraper-order, web-scraper-start-url, house, house-href

In [419]:
df.drop(columns=['ï»¿web-scraper-order', 'web-scraper-start-url', 'house', 'house-href'], inplace=True)
df.head()

,price,location,luas_bangunan,luas_tanah,sertifikasi,n_bedroom,n_bathroom,n_lantai
0,Rp 2.460.000.000,"Jagakarsa, Jakarta Selatan, Jakarta D.K.I.",200.0,133.0,SHM - Sertifikat Hak Milik,5,5,2.0
1,Rp 875.000.000,"Ciputat, Tangerang Selatan Kota, Banten",45.0,140.0,SHM - Sertifikat Hak Milik,2,1,1.0
2,Rp 1.310.000.000,"Ciledug, Tangerang Kota, Banten",75.0,100.0,SHM - Sertifikat Hak Milik,3,2,1.0
3,Rp 7.500.000.000,"Palmerah, Jakarta Barat, Jakarta D.K.I.",350.0,235.0,SHM - Sertifikat Hak Milik,5,4,2.0
4,Rp 2.460.000.000,"Cinere, Depok Kota, Jawa Barat",200.0,133.0,SHM - Sertifikat Hak Milik,5,5,2.0

2b. Check the Data Info

In [420]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 520 entries, 0 to 519
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          519 non-null    object
 1   location       519 non-null    object
 2   luas_bangunan  519 non-null    float64
 3   luas_tanah     519 non-null    float64
 4   sertifikasi    505 non-null    object
 5   n_bedroom      519 non-null    object
 6   n_bathroom     519 non-null    object
 7   n_lantai       487 non-null    float64
dtypes: float64(3), object(5)
memory usage: 32.6+ KB

Based on the above info we
- Need to check the duplicates and the missing values because the amount of non-null are not similar
- Need to convert the data type of columns: price, luas_bangunan, luas_tanah, n_bedroom, n_bathroom, n_lantai

Check Duplicates

In [421]:
df.duplicated().sum()

60

Remove duplicates

In [422]:
df= df.drop_duplicates()
df.duplicated().sum()

0

In [423]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 460 entries, 0 to 519
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          459 non-null    object
 1   location       459 non-null    object
 2   luas_bangunan  459 non-null    float64
 3   luas_tanah     459 non-null    float64
 4   sertifikasi    445 non-null    object
 5   n_bedroom      459 non-null    object
 6   n_bathroom     459 non-null    object
 7   n_lantai       427 non-null    float64
dtypes: float64(3), object(5)
memory usage: 32.3+ KB

Check Missing Value

In [424]:
df.isnull().sum()

price             1
location          1
luas_bangunan     1
luas_tanah        1
sertifikasi      15
n_bedroom         1
n_bathroom        1
n_lantai         33
dtype: int64

Remove Missing Value

In [425]:
df= df.dropna()
df.isnull().sum()

price            0
location         0
luas_bangunan    0
luas_tanah       0
sertifikasi      0
n_bedroom        0
n_bathroom       0
n_lantai         0
dtype: int64

In [426]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 414 entries, 0 to 519
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          414 non-null    object
 1   location       414 non-null    object
 2   luas_bangunan  414 non-null    float64
 3   luas_tanah     414 non-null    float64
 4   sertifikasi    414 non-null    object
 5   n_bedroom      414 non-null    object
 6   n_bathroom     414 non-null    object
 7   n_lantai       414 non-null    float64
dtypes: float64(3), object(5)
memory usage: 29.1+ KB

Rearrange Columns

In [427]:
#Rearrange columns
df= df[['n_bedroom', 'n_bathroom', 'n_lantai', 'luas_tanah', 'luas_bangunan', 'sertifikasi', 'location', 'price']]
df.head()

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
0,5,5,2.0,133.0,200.0,SHM - Sertifikat Hak Milik,"Jagakarsa, Jakarta Selatan, Jakarta D.K.I.",Rp 2.460.000.000
1,2,1,1.0,140.0,45.0,SHM - Sertifikat Hak Milik,"Ciputat, Tangerang Selatan Kota, Banten",Rp 875.000.000
2,3,2,1.0,100.0,75.0,SHM - Sertifikat Hak Milik,"Ciledug, Tangerang Kota, Banten",Rp 1.310.000.000
3,5,4,2.0,235.0,350.0,SHM - Sertifikat Hak Milik,"Palmerah, Jakarta Barat, Jakarta D.K.I.",Rp 7.500.000.000
4,5,5,2.0,133.0,200.0,SHM - Sertifikat Hak Milik,"Cinere, Depok Kota, Jawa Barat",Rp 2.460.000.000

Checking Data Type in Each Columns

In [428]:
df.dtypes

n_bedroom         object
n_bathroom        object
n_lantai         float64
luas_tanah       float64
luas_bangunan    float64
sertifikasi       object
location          object
price             object
dtype: object

In [429]:
#converting data type object to integer for columns: n_bedroom, n_bathroom

#for 'n_bedroom'
df['n_bedroom'] = df['n_bedroom'].astype(str).astype(int)

ValueError: invalid literal for int() with base 10: '>10'

Error above shows that in OLX they assigned '>10' if the listed house have more than 10 bedrooms, due to uncertainties in the value, we need to remove the rows containing this value as well

In [430]:
#locate the rows containing this anomaly
df.loc[df['n_bedroom'] == '>10']

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
126,>10,>10,3.0,212.0,425.0,SHM - Sertifikat Hak Milik,"Cilandak, Jakarta Selatan, Jakarta D.K.I.",Rp 8.300.000.000
202,>10,8,2.0,2025.0,1500.0,SHM - Sertifikat Hak Milik,"Pancoran, Jakarta Selatan, Jakarta D.K.I.",Rp 45.000.000.000
258,>10,6,2.0,464.0,350.0,SHM - Sertifikat Hak Milik,"Kebayoran Baru, Jakarta Selatan, Jakarta D.K.I.",Rp 5.850.000.000
299,>10,>10,2.0,242.0,430.0,SHM - Sertifikat Hak Milik,"Kebayoran Baru, Jakarta Selatan, Jakarta D.K.I.",Rp 12.900.000.000
339,>10,6,2.0,600.0,410.0,HGB - Hak Guna Bangun,"Mampang Prapatan, Jakarta Selatan, Jakarta D.K.I.",Rp 7.200.000.000
457,>10,>10,3.0,300.0,600.0,SHM - Sertifikat Hak Milik,"Mampang Prapatan, Jakarta Selatan, Jakarta D.K.I.",Rp 18.000.000.000

In [431]:
#remove the anomaly
df = df[df["n_bedroom"].str.contains(">10") == False]

In [432]:
df['n_bedroom'] = df['n_bedroom'].astype(str).astype(int)

In [433]:
# for bathroom
df['n_bathroom'] = df['n_bathroom'].astype(str).astype(int)

ValueError: invalid literal for int() with base 10: '>10'

Error above shows that in OLX they assigned '>10' if the listed house have more than 10 bathrooms, due to uncertainties in the value, we need to remove the rows containing this value as well

In [434]:
df.loc[df['n_bathroom'] == '>10']

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
353,8,>10,2.0,852.0,1422.0,HGB - Hak Guna Bangun,"Kebayoran Baru, Jakarta Selatan, Jakarta D.K.I.",Rp 49.000.000.000
447,10,>10,2.0,212.0,425.0,SHM - Sertifikat Hak Milik,"Cilandak, Jakarta Selatan, Jakarta D.K.I.",Rp 8.300.000.000

In [435]:
#remove the anomaly
df = df[df["n_bathroom"].str.contains(">10") == False]
df['n_bathroom'] = df['n_bathroom'].astype(str).astype(int)

In [436]:
df.dtypes

n_bedroom          int64
n_bathroom         int64
n_lantai         float64
luas_tanah       float64
luas_bangunan    float64
sertifikasi       object
location          object
price             object
dtype: object

In [437]:
#converting float to integer for columns: n_lantai, luas_tanah, luas_bangunan
df['n_lantai'] = df['n_lantai'].apply(np.int64)
df['luas_tanah'] = df['luas_tanah'].apply(np.int64)
df['luas_bangunan'] = df['luas_bangunan'].apply(np.int64)

In [438]:
df.dtypes

n_bedroom         int64
n_bathroom        int64
n_lantai          int64
luas_tanah        int64
luas_bangunan     int64
sertifikasi      object
location         object
price            object
dtype: object

In [439]:
#check the unique values in 'sertifikasi'
print(df["sertifikasi"].unique())

['SHM - Sertifikat Hak Milik' 'HGB - Hak Guna Bangun'
 'Lainnya (PPJB, Girik, Adat, dll)']

In [440]:
#reformat 'sertifikasi'
certs= df["sertifikasi"]
new_certs = []

for i in certs:
  # print(i.split('-')[0])
  new_certs.append(i.split(' ')[0])

df["sertifikasi"] = new_certs
df['sertifikasi'] = df['sertifikasi'].astype(str)

print(df["sertifikasi"].unique())

['SHM' 'HGB' 'Lainnya']

In [441]:
#check the unique values in 'location'
print(df["location"].unique())

['Jagakarsa, Jakarta Selatan, Jakarta D.K.I.'
 'Ciputat, Tangerang Selatan Kota, Banten'
 'Ciledug, Tangerang Kota, Banten'
 'Palmerah, Jakarta Barat, Jakarta D.K.I.'
 'Cinere, Depok Kota, Jawa Barat' 'Ciracas, Jakarta Timur, Jakarta D.K.I.'
 'Setia Budi, Jakarta Selatan, Jakarta D.K.I.'
 'Makasar, Jakarta Timur, Jakarta D.K.I.'
 'Tebet, Jakarta Selatan, Jakarta D.K.I.'
 'Ciputat Timur, Tangerang Selatan Kota, Banten'
 'Senen, Jakarta Pusat, Jakarta D.K.I.'
 'Cilandak, Jakarta Selatan, Jakarta D.K.I.'
 'Kebayoran Lama, Jakarta Selatan, Jakarta D.K.I.'
 'Pesanggrahan, Jakarta Selatan, Jakarta D.K.I.'
 'Pasar Minggu, Jakarta Selatan, Jakarta D.K.I.'
 'Kebayoran Baru, Jakarta Selatan, Jakarta D.K.I.'
 'Pancoran, Jakarta Selatan, Jakarta D.K.I.'
 'Mampang Prapatan, Jakarta Selatan, Jakarta D.K.I.']

In [442]:
#remove non jakarta selatan data 
df = df[df["location"].str.contains('Jakarta Selatan') == True]

In [443]:
print(df["location"].unique())

['Jagakarsa, Jakarta Selatan, Jakarta D.K.I.'
 'Setia Budi, Jakarta Selatan, Jakarta D.K.I.'
 'Tebet, Jakarta Selatan, Jakarta D.K.I.'
 'Cilandak, Jakarta Selatan, Jakarta D.K.I.'
 'Kebayoran Lama, Jakarta Selatan, Jakarta D.K.I.'
 'Pesanggrahan, Jakarta Selatan, Jakarta D.K.I.'
 'Pasar Minggu, Jakarta Selatan, Jakarta D.K.I.'
 'Kebayoran Baru, Jakarta Selatan, Jakarta D.K.I.'
 'Pancoran, Jakarta Selatan, Jakarta D.K.I.'
 'Mampang Prapatan, Jakarta Selatan, Jakarta D.K.I.']

In [444]:
#reformating the 'location'
locations = df["location"]
new_locations = []

for i in locations:
  # print(i.split(',')[0])
  new_locations.append(i.split(',')[0])

df["location"] = new_locations
df['location'] = df['location'].astype(str)

In [445]:
df.head()

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
0,5,5,2,133,200,SHM,Jagakarsa,Rp 2.460.000.000
8,6,1,1,148,148,SHM,Setia Budi,Rp 1.100.000.000
13,5,4,3,84,200,SHM,Tebet,Rp 2.100.000.000
23,4,3,2,160,190,SHM,Cilandak,Rp 3.600.000.000
24,3,3,1,303,250,SHM,Kebayoran Lama,Rp 10.500.000.000

In [446]:
#reformating 'price' column
prices = df["price"]
new_prices = []

for i in prices:
  # print(''.join(i.split(' ')[1].split('.')))
  new_prices.append(''.join(i.split(' ')[1].split('.')))

df["price"] = new_prices

In [447]:
df.head()

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
0,5,5,2,133,200,SHM,Jagakarsa,2460000000
8,6,1,1,148,148,SHM,Setia Budi,1100000000
13,5,4,3,84,200,SHM,Tebet,2100000000
23,4,3,2,160,190,SHM,Cilandak,3600000000
24,3,3,1,303,250,SHM,Kebayoran Lama,10500000000

In [448]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 390 entries, 0 to 519
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   n_bedroom      390 non-null    int64
 1   n_bathroom     390 non-null    int64
 2   n_lantai       390 non-null    int64
 3   luas_tanah     390 non-null    int64
 4   luas_bangunan  390 non-null    int64
 5   sertifikasi    390 non-null    object
 6   location       390 non-null    object
 7   price          390 non-null    object
dtypes: int64(5), object(3)
memory usage: 27.4+ KB

In [449]:
df['price'] = df['price'].astype(str).astype(int)

In [450]:
df.head()

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
0,5,5,2,133,200,SHM,Jagakarsa,2460000000
8,6,1,1,148,148,SHM,Setia Budi,1100000000
13,5,4,3,84,200,SHM,Tebet,2100000000
23,4,3,2,160,190,SHM,Cilandak,3600000000
24,3,3,1,303,250,SHM,Kebayoran Lama,10500000000

In [451]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 390 entries, 0 to 519
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   n_bedroom      390 non-null    int64
 1   n_bathroom     390 non-null    int64
 2   n_lantai       390 non-null    int64
 3   luas_tanah     390 non-null    int64
 4   luas_bangunan  390 non-null    int64
 5   sertifikasi    390 non-null    object
 6   location       390 non-null    object
 7   price          390 non-null    int64
dtypes: int64(6), object(2)
memory usage: 27.4+ KB

In [452]:
df.reset_index(inplace=True, drop=True)
df.head()

,n_bedroom,n_bathroom,n_lantai,luas_tanah,luas_bangunan,sertifikasi,location,price
0,5,5,2,133,200,SHM,Jagakarsa,2460000000
1,6,1,1,148,148,SHM,Setia Budi,1100000000
2,5,4,3,84,200,SHM,Tebet,2100000000
3,4,3,2,160,190,SHM,Cilandak,3600000000
4,3,3,1,303,250,SHM,Kebayoran Lama,10500000000

In [453]:
df.dtypes

n_bedroom         int64
n_bathroom        int64
n_lantai          int64
luas_tanah        int64
luas_bangunan     int64
sertifikasi      object
location         object
price             int64
dtype: object

## Write Output CSV

In [454]:
#write to csv 
df.to_csv('../data/processed/olx_house_processed.csv', index=False)

# MISC: Output 2nd CSV with Column Name in English

In [455]:
df_alt = df
df_alt.columns = ["NBED","NBATH","NFLOOR","BLDAR", "LNDAR", "CERT", "LOC", "Price"]
df_alt.head()

   NBED  NBATH  NFLOOR  BLDAR  LNDAR CERT             LOC        Price
0     5      5       2    133    200  SHM       Jagakarsa   2460000000
1     6      1       1    148    148  SHM      Setia Budi   1100000000
2     5      4       3     84    200  SHM           Tebet   2100000000
3     4      3       2    160    190  SHM        Cilandak   3600000000
4     3      3       1    303    250  SHM  Kebayoran Lama  10500000000

In [456]:
#write to csv 
df_alt.to_csv('../data/processed/olx_house_processed_ENG.csv', index=False)

# FIN